app/views/home/_comment.html.erb

				<div class = "right">
					commented by <%=comment.user.firstName%> <%=comment.user.lastName%>
					on <%=comment.created_at.strftime("%b %d,%y")%>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
INSERT INTO "comments" ("content", "user_id", "answer_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "really?\r\n"], ["user_id", 1], ["answer_id", 1], ["created_at", "2017-07-24 05:25:45.026752"], ["updated_at", "2017-07-24 05:25:45.026752"]]

<% if current_user != nil%>
		<%= link_to 'Upvote', url_for(controller: 'upvotecs', action: 'upvoteToggleComment', comment: comment.id), method: :post,id: "upvote_comment_#{comment.id}", remote: true, class: comment.classStringComment(current_user.id)%>   <span id="upcount_comment_<%=comment.id%>"><%= comment.upvotecs.count %></span>

		<%= link_to 'Downvote', url_for(controller: 'downvotecs', action: 'downvoteToggleComment', comment: comment.id), method: :post,id: "downvote_comment_#{comment.id}",remote: true, class: comment.classStringCommentDownvote(current_user.id) %>   <span id="downcount_comment_<%=comment.id%>"><%= comment.downvotecs.count %></span>
---
SELECT "upvotecs".* FROM "upvotecs" WHERE "upvotecs"."comment_id" = ? AND "upvotecs"."user_id" = ?  [["comment_id", 1], ["user_id", 1]]
SELECT COUNT(*) FROM "upvotecs" WHERE "upvotecs"."comment_id" = ?  [["comment_id", 1]]
SELECT "downvotecs".* FROM "downvotecs" WHERE "downvotecs"."comment_id" = ? AND "downvotecs"."user_id" = ?  [["comment_id", 1], ["user_id", 1]]
SELECT COUNT(*) FROM "downvotecs" WHERE "downvotecs"."comment_id" = ?  [["comment_id", 1]]

<%end%>
		<% replies = Reply.where(comment_id: comment.id).order(created_at: :desc)%>
---
SELECT "replies".* FROM "replies" WHERE "replies"."comment_id" = ?  ORDER BY "replies"."created_at" DESC  [["comment_id", 1]]