app/views/home/profile.html.erb

SELECT "answers".* FROM "answers" WHERE "answers"."user_id" = ?  ORDER BY "answers"."created_at" DESC  [["user_id", 1]]
---
</div>
<% a = @user.answers.order(created_at: :desc)%>

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
---
		<div class = "right">
		answered by <%=answer.user.firstName%> <%=answer.user.lastName%>